InformationRegisters/Автомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Автомобили</Name>
			<Comment>Дополнительные характеристики автомобилей</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение дополнительного свойства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:EnumRef.ВидАвтомобиля</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КтоВнес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КогдаВнес</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗначения</Name>
					<Comment>Вид значения дополнительного свойства автомобиля</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ДополнительнаяИнформацияАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СМ_Ниссан_Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СМ_Ниссан_Сотрудники</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодСотрудника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ДополнительнаяИнформацияАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ДополнительнаяИнформацияАвтомобилей</Name>
			<Comment>Дополнительная информация автомобилей</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Хозяин</Name>
					<Comment>Признак хозяина автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пробег</Name>
					<Comment>Признак пробега автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосНомер</Name>
					<Comment>Признак государственного номера автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехПаспорт</Name>
					<Comment>Признак номера техпаспорта автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидАвтомобиля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаКонсигнации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервиснаяКнижка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПараллельныйИмпорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаОкончанияОтсрочкиОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГаражныйНомер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапретНаВнутренниеПерепродажи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыСобытий</Name>
			<Comment>Виды событий</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Анкетирование</Name>
					<Comment>Вид события анкетирования</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаАвтомобиля</Name>
					<Comment>Вид события выдачи автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаменаАвтомобиля</Name>
					<Comment>Вид события замены автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичнаяВстреча</Name>
					<Comment>Личная встреча</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказОтАвтомобиля</Name>
					<Comment>Вид события отказа от автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереуступкаАвтомобиля</Name>
					<Comment>Вид события переуступки автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПочтовоеПисьмо</Name>
					<Comment>Почтовое письмо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочее</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТелефонныйЗвонок</Name>
					<Comment>Телефонный звонок</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТестДрайв</Name>
					<Comment>Тест-драйв автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронноеПисьмо</Name>
					<Comment>Электронное письмо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SMS</Name>
					<Comment>SMS событие</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗвонокВежливости</Name>
					<Comment>Звонок вежливости клиенту</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаССайта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тендер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БачатаАвто</Name>
					<Comment>Событие агрегатора Бачата Авто</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОАБР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ООАБР</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СостоянияСобытий</Name>
			<Comment>Состояния событий</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланировано</Name>
					<Comment>Запланировано</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
					<Comment>Выполняется</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
					<Comment>Отменено</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
					<Comment>Завершено</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утверждено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СМ_Ниссан_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>СМ_Ниссан_Настройки</Name>
			<Comment>Проекты</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГруппаПодразделений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДилера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/СМ_Ниссан/Ext/Module.bsl
Процедура СМ_Ниссан_МониторЗаписи(Параметры=Неопределено) Экспорт
	
	Выборка = Справочники.СМ_Ниссан_Настройки.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ЭтоГруппа Тогда
		    Продолжить;
		КонецЕсли;
		
		Если Выборка.ПометкаУдаления Тогда
		    Продолжить;
 		КонецЕсли;
		
		АдресFTP = Выборка.АдресСервера;		
 		Если ПустаяСтрока(АдресFTP) Тогда
			Продолжить;		
		КонецЕсли;
		
		КодДилера = Выборка.КодДилера;
 		Если ПустаяСтрока(КодДилера) Тогда
			Продолжить;		
		КонецЕсли;
 		
		ГруппаПодразделений = Выборка.ГруппаПодразделений;
		Если обЗначениеНеЗаполнено(ГруппаПодразделений) Тогда
			Продолжить;		
		КонецЕсли;	
		
		Для Счетчик = 1  По 2 Цикл
			
 			СписокСотрудников = Новый СписокЗначений;
 			СписокСотрудников = ЗаполнитьРегистрСведенийСМНиссанСотрудники(Счетчик);		
			ОтправитьСжатыеФотоНаСерверFTP(СписокСотрудников,АдресFTP);
 			
			ФайлXML = ПолучитьИмяВременногоФайла("XML");
			
			СформироватьФайлXML(ФайлXML,ГруппаПодразделений,КодДилера,АдресFTP,Счетчик);
			
			Если НЕ обЗначениеНеЗаполнено(ФайлXML) Тогда
				
				ИмяПользователя = "dmsdataprovider";
				ПарольПользователя = "F3tpzJVybp";
				
				Соединение = ПодключитьсяКFTPСерверу(АдресFTP,ИмяПользователя,ПарольПользователя);
				
				Если Счетчик = 1 Тогда
					Соединение.Записать(ФайлXML, "/service_meetings.xml");
 				Иначе
					Соединение.Записать(ФайлXML, "/other_meetings.xml");
				КонецЕсли;
				
 			КонецЕсли; 
			
			ФайлДляУдаления = Новый Файл(ФайлXML);
			
			Если ФайлДляУдаления.Существует() Тогда
				
				Попытка
					УдалитьФайлы(ФайлДляУдаления.Путь,ФайлДляУдаления.Имя);                                                         
				Исключение
				КонецПопытки;
				
			КонецЕсли;
		КонецЦикла;

 		
	КонецЦикла;   
	
КонецПроцедуры 
     
Процедура СформироватьФайлXML(ФайлXML,ГруппаПодразделений,КодДилера,АдресFTP,Счетчик) Экспорт 
   	
	ТЗ = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
	
	Если Счетчик = 1 Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаРемонтПланирование.Ссылка,
		|	ЗаявкаНаРемонтПланирование.Авторабота,
		|	ЗаявкаНаРемонтПланирование.НачалоВыполнения КАК НачалоВыполнения,
		|	ЗаявкаНаРемонтПланирование.Ссылка.Диспетчер,
		|	ЗаявкаНаРемонтПланирование.Ссылка.Заказчик,
		|	ЗаявкаНаРемонтПланирование.Ссылка.Автомобиль КАК Автомобиль,
		|	ЗаявкаНаРемонтПланирование.Ссылка.ПредставлениеТелефона,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаРемонтПланирование.Ссылка.Автомобиль) = ТИП(Справочник.Модели)
		|			ТОГДА ЗаявкаНаРемонтПланирование.Ссылка.Автомобиль.Наименование
		|		ИНАЧЕ ЗаявкаНаРемонтПланирование.Ссылка.Автомобиль.Модель.Наименование
		|	КОНЕЦ КАК МодельАвто,
		|	ХарактеристикиАвто.Значение КАК ГосНомер,
		|	ВЫРАЗИТЬ(ЗаявкаНаРемонтПланирование.Авторабота.НаименованиеПолное КАК СТРОКА(100)) КАК НаименованиеРаботы,
		|	ЗаявкаНаРемонтПланирование.Ссылка.Диспетчер.Фамилия КАК ДиспетчерФамилия,
		|	ЗаявкаНаРемонтПланирование.Ссылка.Диспетчер.Имя КАК ДиспетчерИмя,
		|	РегистрКодовСотрудников.КодСотрудника
		|ИЗ
		|	Документ.ЗаявкаНаРемонт.Планирование КАК ЗаявкаНаРемонтПланирование
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
		|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
		|			АвтомобилиСрезПоследних.Значение КАК Значение
		|		ИЗ
		|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
		|		ГДЕ
		|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ГосНомер)) КАК ХарактеристикиАвто
		|		ПО ЗаявкаНаРемонтПланирование.Ссылка.Автомобиль = ХарактеристикиАвто.Автомобиль
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СМ_Ниссан_Сотрудники.Сотрудник КАК Сотрудник,
		|			СМ_Ниссан_Сотрудники.КодСотрудника КАК КодСотрудника
		|		ИЗ
		|			РегистрСведений.СМ_Ниссан_Сотрудники КАК СМ_Ниссан_Сотрудники) КАК РегистрКодовСотрудников
		|		ПО ЗаявкаНаРемонтПланирование.Ссылка.Диспетчер = РегистрКодовСотрудников.Сотрудник
		|ГДЕ
		|	ЗаявкаНаРемонтПланирование.НачалоВыполнения МЕЖДУ &ДатаВремяНачала И &ДатаВремяОкончания
		|	И ЗаявкаНаРемонтПланирование.РабочееМесто.Подразделение В ИЕРАРХИИ(&ГруппаПодразделений)
		|	И (ЗаявкаНаРемонтПланирование.Авторабота.НаименованиеПолное ПОДОБНО &Приемка
		|			ИЛИ ЗаявкаНаРемонтПланирование.Авторабота.НаименованиеПолное ПОДОБНО &Выдача)
		|	И ЗаявкаНаРемонтПланирование.Ссылка.ПодразделениеКомпании В ИЕРАРХИИ(&ГруппаПодразделений)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НачалоВыполнения";
		
		Запрос.УстановитьПараметр("Приемка","%приемка%");  
		Запрос.УстановитьПараметр("Выдача","%выдача%"); 
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Событие.Ссылка,
		|	Событие.ВидСобытия КАК Авторабота,
		|	Событие.ДатаНачала КАК НачалоВыполнения,
		|	Событие.Продавец КАК Диспетчер,
		|	Событие.Контрагент КАК Заказчик,
		|	РабочиеЛисты.Автомобиль КАК Автомобиль,
		|	Событие.ПредставлениеТелефона,
		|	РабочиеЛисты.МодельНаименование КАК МодельАвто,
		|	ХарактеристикиАвто.ГосНомер КАК ГосНомер,
		|	Событие.ВидСобытия КАК НаименованиеРаботы,
		|	Событие.Продавец.Фамилия КАК ДиспетчерФамилия,
		|	Событие.Продавец.Имя КАК ДиспетчерИмя,
		|	СМ_Ниссан_Сотрудники.КодСотрудника КАК КодСотрудника
		|ИЗ
		|	Документ.Событие КАК Событие
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			РабочийЛист.Ссылка КАК Ссылка,
		|			РабочийЛист.Модель КАК Модель,
		|			РабочийЛист.Модель.Наименование КАК МодельНаименование,
		|			РабочийЛист.Автомобиль КАК Автомобиль
		|		ИЗ
		|			Документ.РабочийЛист КАК РабочийЛист) КАК РабочиеЛисты
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
		|				АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
		|				АвтомобилиСрезПоследних.Значение КАК ГосНомер
		|			ИЗ
		|				РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
		|			ГДЕ
		|				АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ГосНомер)) КАК ХарактеристикиАвто
		|			ПО РабочиеЛисты.Автомобиль = ХарактеристикиАвто.Автомобиль
		|		ПО Событие.ДокументОснование = РабочиеЛисты.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СМ_Ниссан_Сотрудники.Сотрудник КАК Сотрудник,
		|			СМ_Ниссан_Сотрудники.КодСотрудника КАК КодСотрудника
		|		ИЗ
		|			РегистрСведений.СМ_Ниссан_Сотрудники КАК СМ_Ниссан_Сотрудники) КАК СМ_Ниссан_Сотрудники
		|		ПО Событие.Продавец = СМ_Ниссан_Сотрудники.Сотрудник
		|ГДЕ
		|	Событие.ПодразделениеКомпании В ИЕРАРХИИ(&ГруппаПодразделений)
		|	И Событие.ДатаНачала МЕЖДУ &ДатаВремяНачала И &ДатаВремяОкончания
		|	И Событие.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ЛичнаяВстреча)
		|	И Событие.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСобытий.Запланировано)";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ГруппаПодразделений",ГруппаПодразделений); //	
	Запрос.УстановитьПараметр("ДатаВремяНачала",НачалоДня(ТекущаяДата()));
	//Запрос.УстановитьПараметр("ДатаВремяНачала",ДобавитьМесяц(НачалоДня(ТекущаяДата()),-1));
	Запрос.УстановитьПараметр ("ДатаВремяОкончания",КонецДня(ТекущаяДата()));
	
	ТЗ = Запрос.Выполнить().Выгрузить(); 
	
  	ИмяБазы = "alfaauto";
	Попытка
		Результат = Renault_внОбщийМодуль.ПараметрУникальностиИБ();
 		ИмяБазы = СокрЛП(Результат.ИмяБазы);
	Исключение
		//	
	КонецПопытки; 
	
	ДатаТек    = Строка(Формат(ТекущаяДата(),"ДФ=yyyy-MM-dd"));
	ВремяТек   = Строка(Формат(ТекущаяДата(),"ДЛФ=T"));	
 	ЧасыРаботы = "Часы работы: 08:00 - 19:00";
 	
  	XML=Новый ЗаписьXML();
	
	XML.ОткрытьФайл(ФайлXML);
	
	//XML.УстановитьСтроку(Новый ПараметрыЗаписиXML("UTF-8","1.0",false));
	   	
 	XML.ЗаписатьОбъявлениеXML();
	
  	XML.ЗаписатьНачалоЭлемента("АFTERSALES_DMS");
	
		XML.ЗаписатьНачалоЭлемента("EXTRACTION");
	
			XML.ЗаписатьНачалоЭлемента("EXTRACTION_DATE");            XML.ЗаписатьТекст(ДатаТек);     XML.ЗаписатьКонецЭлемента();
			XML.ЗаписатьНачалоЭлемента("EXTRACTION_TIME");            XML.ЗаписатьТекст(ВремяТек);    XML.ЗаписатьКонецЭлемента();
			XML.ЗаписатьНачалоЭлемента("EXTRACTION_DEALERSHIP_CODE"); XML.ЗаписатьТекст(КодДилера);   XML.ЗаписатьКонецЭлемента();
			XML.ЗаписатьНачалоЭлемента("SCROLLING_BANNER_MESSAGE");   XML.ЗаписатьТекст(ЧасыРаботы);  XML.ЗаписатьКонецЭлемента();
	
		XML.ЗаписатьКонецЭлемента(); //EXTRACTION	
	
		XML.ЗаписатьНачалоЭлемента("MEETINGS");
		
			Для каждого Стр1 Из ТЗ Цикл
				
				ДатаНачала     = Строка(Формат(Стр1.НачалоВыполнения,"ДФ=yyyy-MM-dd"));
				ВремяНачала    = Строка(Формат(Стр1.НачалоВыполнения,"ДЛФ=T"));
				
				Если Счетчик = 1 Тогда
					КлиентСтрокой = СокрЛП(Стр1.МодельАвто)+" | "+СокрЛП(Стр1.ГосНомер);
 					Если Найти(ВРЕГ(Стр1.НаименованиеРаботы),"ВЫДАЧА") > 0 Тогда
						КлиентСтрокой = СокрЛП(КлиентСтрокой) + " | "+"ВЫДАЧА";
					Иначе	
						КлиентСтрокой = СокрЛП(КлиентСтрокой) + " | "+"ЗАЕЗД";	 				
					КонецЕсли;
				Иначе
					КлиентСтрокой = СокрЛП(Стр1.МодельАвто)+" "+СокрЛП(Стр1.ГосНомер);
					КлиентСтрокой = СокрЛП(КлиентСтрокой) + " | "+СокрЛП(Стр1.НаименованиеРаботы)+" "+СокрЛП(Стр1.Заказчик);
				КонецЕсли;
 				
				Если НЕ обЗначениеНеЗаполнено(Стр1.ДиспетчерФамилия) И НЕ обЗначениеНеЗаполнено(Стр1.ДиспетчерИмя) Тогда
					ДиспетчерСтрокой = СокрЛП(Стр1.ДиспетчерФамилия)+" "+СокрЛП(Стр1.ДиспетчерИмя);
				Иначе	
					ДиспетчерСтрокой = СокрЛП(Стр1.Диспетчер);					
				КонецЕсли;  
				
				ДиспетчерКод = СокрЛП(Стр1.КодСотрудника);
				
				XML.ЗаписатьНачалоЭлемента("MEETING");
				
				XML.ЗаписатьНачалоЭлемента("DEPOSIT_DATE");  XML.ЗаписатьТекст(ДатаНачала);       XML.ЗаписатьКонецЭлемента();
				XML.ЗаписатьНачалоЭлемента("DEPOSIT_TIME");  XML.ЗаписатьТекст(ВремяНачала);      XML.ЗаписатьКонецЭлемента();
				XML.ЗаписатьНачалоЭлемента("CUSTOMER_NAME"); XML.ЗаписатьТекст(КлиентСтрокой);    XML.ЗаписатьКонецЭлемента();
				XML.ЗаписатьНачалоЭлемента("ADVISOR_CODE");  XML.ЗаписатьТекст(ДиспетчерКод);     XML.ЗаписатьКонецЭлемента();
				XML.ЗаписатьНачалоЭлемента("ADVISOR_NAME");  XML.ЗаписатьТекст(ДиспетчерСтрокой); XML.ЗаписатьКонецЭлемента();
				
				XML.ЗаписатьКонецЭлемента(); //MITING
				
			КонецЦикла; 
		
		XML.ЗаписатьКонецЭлемента();	 //MITINGS
		
	XML.ЗаписатьКонецЭлемента();     //АFTERSALES_DMS	

	XML.Закрыть(); 
   
КонецПроцедуры // СформироватьФайлXML(ФайлXML,ГруппаПодразделений,КодДилера) )

Функция ПодключитьсяКFTPСерверу(АдресFTP,ИмяПользователя,ПарольПользователя) Экспорт
	Соединение = Новый FTPСоединение(
        АдресFTP, // адрес ftp сервера
        21, // порт сервера
        ИмяПользователя, // имя пользователя
        ПарольПользователя, // пароль пользователя
        Неопределено, // прокси не используется
        Истина, // пассивный режим работы
        0, // таймаут (0 - без ограничений)
        Неопределено // незащищенное соединение
    );
 
    // Для случаев, когда у ftp сервера нет возможности
    // обращаться к нам (мы находимся за межсетевым экраном)
    // следует использовать пассивный режим работы.
 
    Возврат Соединение;
КонецФункции
  
Функция ЗаполнитьРегистрСведенийСМНиссанСотрудники(Счетчик) Экспорт
	
	СписокСотрудниковТек = Новый СписокЗначений;
	
 	Запрос = Новый Запрос;
	
	Если Счетчик = 1 Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаявкаНаРемонтПланирование.Ссылка.Диспетчер КАК Диспетчер
		|ИЗ
		|	Документ.ЗаявкаНаРемонт.Планирование КАК ЗаявкаНаРемонтПланирование
		|ГДЕ
		|	(ЗаявкаНаРемонтПланирование.Авторабота.НаименованиеПолное ПОДОБНО &Приемка
		|			ИЛИ ЗаявкаНаРемонтПланирование.Авторабота.НаименованиеПолное ПОДОБНО &Выдача)
		|	И ЗаявкаНаРемонтПланирование.Ссылка.Дата >= &ДатаНачала";
 		Запрос.УстановитьПараметр("Приемка","%приемка%");  
		Запрос.УстановитьПараметр("Выдача","%выдача%");
 	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Событие.Продавец КАК Диспетчер
		|ИЗ
		|	Документ.Событие КАК Событие
		|ГДЕ
		|	Событие.Проведен = ИСТИНА
		|	И Событие.ДатаНачала >= &ДатаНачала
		|	И Событие.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСобытий.Запланировано)
		|	И Событие.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ЛичнаяВстреча)";
	КонецЕсли;
 	Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(ТекущаяДата()));		
       	
	СписокСотрудниковТек.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Диспетчер")); 
	
	НаборЗаписей = РегистрыСведений.СМ_Ниссан_Сотрудники.СоздатьНаборЗаписей();
	
	Для каждого ТекЭл Из СписокСотрудниковТек Цикл
		
		Если обЗначениеНеЗаполнено(ТекЭл.Значение) Тогда
			Продолжить;		
 		КонецЕсли; 		
		
 		НаборЗаписей.Отбор.Сотрудник.Установить(ТекЭл.Значение);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			НовЗапись = РегистрыСведений.СМ_Ниссан_Сотрудники.СоздатьМенеджерЗаписи();		
			НовЗапись.Сотрудник = ТекЭл.Значение;
			НовыйКодСотрудника = НайтиМаксимальныйКодСотрудника()+1;
			НовЗапись.КодСотрудника = ДополнитьСтрокуЛ(СтрЗаменить(НовыйКодСотрудника,Символы.НПП,""), 4, "0"); 
			НовЗапись.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СписокСотрудниковТек;
  
КонецФункции

Функция НайтиМаксимальныйКодСотрудника() Экспорт
	
	КодСотрудника = Число("0");	
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СМ_Ниссан_Сотрудники.КодСотрудника КАК КодСотрудника
		|ИЗ
		|	РегистрСведений.СМ_Ниссан_Сотрудники КАК СМ_Ниссан_Сотрудники
		|
		|УПОРЯДОЧИТЬ ПО
		|	КодСотрудника УБЫВ";
	
	ТабЗн = Запрос.Выполнить().Выгрузить();
 	 
 	Если ТабЗН.Количество() >  0 Тогда
		КодСотрудника = Число(ТабЗН[0].КодСотрудника);
 	КонецЕсли;

	Возврат КодСотрудника;

КонецФункции // НайтиМаксимальныйКодСотрудника()

// Функция дополняет строку слева до указаной длины определенным символом
//
// Параметры:
//	Стр		- Строка	- Строка
//	Длина	- Число		- Длина строки
//	Чем		- Строка	- Символ для добавления
//
// Возвращаемое значение:
//	Строка	- Строка, дополненная слева до указанной длины
//
Функция ДополнитьСтрокуЛ(Знач Стр, Длина, Чем = " ") Экспорт
	
	СимволовДополнить = Длина - СтрДлина(Стр);
	
	Добавок = "";
	
	Для Н = 1 По СимволовДополнить Цикл
		Добавок = Добавок + Чем;
	КонецЦикла;
	
	Возврат Добавок + Стр;

КонецФункции

Процедура ОтправитьСжатыеФотоНаСерверFTP(СписокСотрудников,АдресFTP) Экспорт
 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СМ_Ниссан_Сотрудники.Сотрудник,
		|	СМ_Ниссан_Сотрудники.КодСотрудника,
		|	КартинкиИФайлы.ОтносительныйПуть,
		|	КартинкиИФайлы.Расширение,
		|	КартинкиИФайлы.Основной,
		|	КартинкиИФайлы.Идентификатор
		|ИЗ
		|	РегистрСведений.СМ_Ниссан_Сотрудники КАК СМ_Ниссан_Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КартинкиИФайлы.Объект КАК Объект,
		|			КартинкиИФайлы.ОтносительныйПуть КАК ОтносительныйПуть,
		|			КартинкиИФайлы.Расширение КАК Расширение,
		|			КартинкиИФайлы.Основной КАК Основной,
		|			КартинкиИФайлы.Идентификатор КАК Идентификатор,
		|			КартинкиИФайлы.НазваниеФайла КАК НазваниеФайла
		|		ИЗ
		|			РегистрСведений.КартинкиИФайлы КАК КартинкиИФайлы) КАК КартинкиИФайлы
		|		ПО СМ_Ниссан_Сотрудники.Сотрудник = КартинкиИФайлы.Объект
		|ГДЕ
		|	ПОДСТРОКА(КартинкиИФайлы.ОтносительныйПуть, 1, 1) <> "" """;
	
 ТЗ=Запрос.Выполнить().Выгрузить();
   
 Для каждого Стр Из ТЗ Цикл
	 
	Если обЗначениеНеЗаполнено(Стр.КодСотрудника) Тогда
		Продолжить;	
 	КонецЕсли;
	
 	Если обЗначениеНеЗаполнено(Стр.ОтносительныйПуть) Тогда
		Продолжить;	
	КонецЕсли;  
	
	ЗаписьНовыйОтносительныйПуть = СокрЛП(Константы.ПустьКХранилищюСканов.Получить())+"\"+СокрЛП(ОбщиеСервер.ПолучитьИмяИБ())+"\"+Сред(Стр.ОтносительныйПуть,Найти(Стр.ОтносительныйПуть,"Файлы"));
  	//Сообщить("Для сотрудника с кодом: "+Стр.КодСотрудника+" и именем "+Стр.Сотрудник+", имя файла для преобразования: "+ЗаписьНовыйОтносительныйПуть); 

	ОткрываемыйФайл = Новый Файл(Стр.Идентификатор);
  	Файл =  ОбщиеСервер.ПолучитьФайлИзХранилища(ЗаписьНовыйОтносительныйПуть);
	
	Попытка
		Файл = Файл.Получить();
	Исключение
		//
	КонецПопытки;	

	Попытка
		Файл.Записать(КаталогВременныхФайлов()+ОбщиеСервер.УбратьЗапрещенныеСимволыВИменифайла(Стр.Идентификатор)+Стр.Расширение);
		ОткрываемыйФайл = Новый Файл(КаталогВременныхФайлов()+ОбщиеСервер.УбратьЗапрещенныеСимволыВИменифайла(Стр.Идентификатор)+Стр.Расширение);
	Исключение
		Попытка
			Файл.Записать(КаталогВременныхФайлов()+Стр.Идентификатор+Стр.Расширение);
			ОткрываемыйФайл = Новый Файл(КаталогВременныхФайлов()+Стр.Идентификатор+Стр.Расширение);
		Исключение
			ОткрываемыйФайл = Новый Файл();
		КонецПопытки;			
	КонецПопытки;	
 	
	Если ОткрываемыйФайл.Существует() Тогда

  		ПолныйПутьКпрограмме = "C:\Program Files\ImageMagick\magick.exe";
		ИмяФайлаПрограммыНаДиске = Новый Файл(ПолныйПутьКпрограмме);
		
		Если   ИмяФайлаПрограммыНаДиске.Существует() Тогда
			
			ИмяФайлаМиниатюры = КаталогВременныхФайлов()+СокрЛП(Стр.КодСотрудника)+Стр.Расширение;
 			
			ИмяКоманды = """"+ПолныйПутьКпрограмме+""" """+СокрЛП(ОткрываемыйФайл.ПолноеИмя)+""" -resize ""400x400>"" """+ИмяФайлаМиниатюры+"""";
			
 			ОписаниеОшибки = "";
 			Попытка
				ОбщиеСервер.ВыполнитьКомандуНаСервере(ИмяКоманды,ОписаниеОшибки);
				ОтправитьФотоНаFTP(ИмяФайлаМиниатюры,АдресFTP);
				УдалитьФайлы(ОткрываемыйФайл);
			Исключение
				ОписаниеОшибки = ОписаниеОшибки();
			КонецПопытки;	
			
		Иначе			
			ОписаниеОшибки = "ОШИБКА! Файл '"+ПолныйПутьКпрограмме+"' не существует.";			
		КонецЕсли; 
		
	КонецЕсли; 
    
 КонецЦикла;
  
КонецПроцедуры 

Процедура ОтправитьФотоНаFTP(ИмяФайлаМиниатюры,АдресFTP) Экспорт

	Если НЕ обЗначениеНеЗаполнено(ИмяФайлаМиниатюры) Тогда
		Если НЕ обЗначениеНеЗаполнено(АдресFTP) Тогда
			
			ИмяПользователя = "dmsdataprovider";
			ПарольПользователя = "F3tpzJVybp";
			
			Соединение = ПодключитьсяКFTPСерверу(АдресFTP,ИмяПользователя,ПарольПользователя);
			
 			МассивСтрок = обРазложитьСтрокуВМассивПодстрок(ИмяФайлаМиниатюры, "\");
			ИмяФайлаМиниатюрыFTP = "/images/"+СокрЛП(МассивСтрок[МассивСтрок.Количество()-1]);
  			Соединение.Записать(ИмяФайлаМиниатюры, ИмяФайлаМиниатюрыFTP);
			
		КонецЕсли; 	
	КонецЕсли; 

КонецПроцедуры
